МПР/src/Documents/ds_УстановкаКатегорийНоменклатуры/ds_УстановкаКатегорийНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ds_УстановкаКатегорийНоменклатуры</name>
  <registerRecords>InformationRegister.ds_КатегорииНоменклатурыПлан</registerRecords>
  <attributes>
    <name>ВидОперации</name>
    <type>
      <types>EnumRef.ds_ВидыОперацийУстановкаКатегорийНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>Категория</name>
    <type>
      <types>CatalogRef.ds_КатегорииНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <comment>Любая дополнительная информация</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Магазин</name>
    <type>
      <types>CatalogRef.Магазины</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

МПР/src/Documents/ds_УстановкаКатегорийНоменклатуры/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Инициализирует таблицы значений, содержащие данные табличных частей документа.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
// Параметры:
//  ДокументСсылка - ДокументСсылка.АктОРасхожденияхПриПриемкеТоваров - документ для инициализации данных.
//  ДополнительныеСвойства - Структура - структура дополнительных свойств.
//
Процедура ИнициализироватьДанныеДокумента(ДокументСсылка, ДополнительныеСвойства) Экспорт

	Запрос = Новый Запрос(
	// 0 ТаблицаЦеныНоменклатуры
	"ВЫБРАТЬ
	|	ds_УстановкаКатегорийНоменклатурыТовары.Номенклатура КАК Номенклатура,
	|	ds_УстановкаКатегорийНоменклатурыТовары.Цена КАК Цена,
	|	ds_УстановкаКатегорийНоменклатурыТовары.Ссылка.Категория КАК КатегорияНоменклатуры,
	|	ds_УстановкаКатегорийНоменклатурыТовары.Ссылка.ДатаНачала КАК Период,
	|	ds_УстановкаКатегорийНоменклатурыТовары.Ссылка.ДатаОкончания КАК ДатаОкончания,
	|	ds_УстановкаКатегорийНоменклатурыТовары.Ссылка.Магазин КАК Магазин
	|ИЗ
	|	Документ.ds_УстановкаКатегорийНоменклатуры.Товары КАК ds_УстановкаКатегорийНоменклатурыТовары
	|ГДЕ
	|	ds_УстановкаКатегорийНоменклатурыТовары.Ссылка = &Ссылка");

	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
	Результат = Запрос.ВыполнитьПакет();
	
	ДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаЦеныНоменклатуры", Результат[0].Выгрузить());

КонецПроцедуры

#КонецОбласти

#КонецЕсли
